results/4-loadtest/google_python_1000.txt
Running 1m test @ https://europe-west1-double-catfish-238707.cloudfunctions.net/python_matrix
  2 threads and 1000 connections
  Thread calibration: mean lat.: 2471.732ms, rate sampling interval: 9355ms
  Thread calibration: mean lat.: 2469.697ms, rate sampling interval: 9215ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.25s     1.98s   12.84s    81.32%
    Req/Sec   527.60     30.22   588.00     80.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.50s 
 75.000%    3.36s 
 90.000%    5.20s 
 99.000%    8.31s 
 99.900%   10.90s 
 99.990%   12.26s 
 99.999%   12.69s 
100.000%   12.85s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     184.831     0.000000            1         1.00
     374.015     0.100000         5014         1.11
     570.879     0.200000        10023         1.25
     826.879     0.300000        15038         1.43
    1089.535     0.400000        20043         1.67
    1495.039     0.500000        25047         2.00
    1803.263     0.550000        27551         2.22
    2148.351     0.600000        30056         2.50
    2519.039     0.650000        32570         2.86
    2916.351     0.700000        35071         3.33
    3360.767     0.750000        37566         4.00
    3608.575     0.775000        38818         4.44
    3858.431     0.800000        40073         5.00
    4134.911     0.825000        41329         5.71
    4444.159     0.850000        42574         6.67
    4796.415     0.875000        43828         8.00
    4997.119     0.887500        44465         8.89
    5197.823     0.900000        45083        10.00
    5398.527     0.912500        45706        11.43
    5623.807     0.925000        46344        13.33
    5902.335     0.937500        46962        16.00
    6066.175     0.943750        47271        17.78
    6250.495     0.950000        47585        20.00
    6447.103     0.956250        47896        22.86
    6660.095     0.962500        48211        26.67
    6905.855     0.968750        48524        32.00
    7032.831     0.971875        48685        35.56
    7167.999     0.975000        48837        40.00
    7327.743     0.978125        48995        45.71
    7512.063     0.981250        49148        53.33
    7774.207     0.984375        49306        64.00
    7925.759     0.985938        49383        71.11
    8060.927     0.987500        49462        80.00
    8212.479     0.989062        49541        91.43
    8396.799     0.990625        49621       106.67
    8675.327     0.992188        49698       128.00
    8806.399     0.992969        49735       142.22
    8953.855     0.993750        49774       160.00
    9109.503     0.994531        49814       182.86
    9289.727     0.995313        49854       213.33
    9502.719     0.996094        49893       256.00
    9625.599     0.996484        49911       284.44
    9781.247     0.996875        49932       320.00
    9887.743     0.997266        49951       365.71
   10035.199     0.997656        49970       426.67
   10215.423     0.998047        49992       512.00
   10289.151     0.998242        49999       568.89
   10461.183     0.998437        50010       640.00
   10608.639     0.998633        50020       731.43
   10797.055     0.998828        50029       853.33
   10919.935     0.999023        50039      1024.00
   11010.047     0.999121        50043      1137.78
   11108.351     0.999219        50048      1280.00
   11231.231     0.999316        50054      1462.86
   11321.343     0.999414        50058      1706.67
   11436.031     0.999512        50063      2048.00
   11444.223     0.999561        50065      2275.56
   11493.375     0.999609        50068      2560.00
   11616.255     0.999658        50070      2925.71
   11706.367     0.999707        50074      3413.33
   11739.135     0.999756        50075      4096.00
   11747.327     0.999780        50076      4551.11
   11919.359     0.999805        50078      5120.00
   12001.279     0.999829        50079      5851.43
   12197.887     0.999854        50080      6826.67
   12206.079     0.999878        50081      8192.00
   12263.423     0.999890        50082      9102.22
   12353.535     0.999902        50083     10240.00
   12353.535     0.999915        50083     11702.86
   12443.647     0.999927        50084     13653.33
   12443.647     0.999939        50084     16384.00
   12484.607     0.999945        50085     18204.44
   12484.607     0.999951        50085     20480.00
   12484.607     0.999957        50085     23405.71
   12689.407     0.999963        50086     27306.67
   12689.407     0.999969        50086     32768.00
   12689.407     0.999973        50086     36408.89
   12689.407     0.999976        50086     40960.00
   12689.407     0.999979        50086     46811.43
   12845.055     0.999982        50087     54613.33
   12845.055     1.000000        50087          inf
#[Mean    =     2245.622, StdDeviation   =     1981.796]
#[Max     =    12836.864, Total count    =        50087]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58588 requests in 1.00m, 26.26MB read
  Socket errors: connect 0, read 0, write 0, timeout 609
Requests/sec:    976.41
Transfer/sec:    448.20KB